Task 11.3 - SOAP

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:getCourseRequest>
         <soap:name>HTML</soap:name>
      </soap:getCourseRequest>
   </soapenv:Body>
</soapenv:Envelope>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ns2:getCourseResponse xmlns:ns2="http://kodilla.com/courses/soap"/>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:getCourseRequest>
         <soap:name>Tester</soap:name>
      </soap:getCourseRequest>
   </soapenv:Body>
</soapenv:Envelope>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ns2:getCourseResponse xmlns:ns2="http://kodilla.com/courses/soap"/>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:getCourseRequest>
            <soap:name>Java Developer Plus</soap:name>
        </soap:getCourseRequest>
    </soapenv:Body>
</soapenv:Envelope>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:getCourseResponse xmlns:ns2="http://kodilla.com/courses/soap">
            <ns2:course>
                <ns2:name>Java Developer Plus</ns2:name>
                <ns2:length>9</ns2:length>
                <ns2:technology>JAVA</ns2:technology>
            </ns2:course>
        </ns2:getCourseResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:getCourseRequest>
         <soap:name>Python</soap:name>
      </soap:getCourseRequest>
   </soapenv:Body>
</soapenv:Envelope>


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ns2:getCourseResponse xmlns:ns2="http://kodilla.com/courses/soap"/>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:getCourseRequest>
         <soap:name>Java Developer</soap:name>
      </soap:getCourseRequest>
   </soapenv:Body>
</soapenv:Envelope>


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ns2:getCourseResponse xmlns:ns2="http://kodilla.com/courses/soap">
         <ns2:course>
            <ns2:name>Java Developer</ns2:name>
            <ns2:length>6</ns2:length>
            <ns2:technology>JAVA</ns2:technology>
         </ns2:course>
      </ns2:getCourseResponse>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

